[
    {
        "source_id": "gucci_fw25_jacket",
        "source_type": "catalogo",
        "content": "Giacca Gucci Fall/Winter 2025 in lana vergine 100%. Linea oversize con spalle structured. Colore: nero con dettagli in pelle bordeaux. Bottoni in metallo con logo GG. Fodera interna in seta. Tasca interna con zip. Made in Italy. Prezzo consigliato: €2,450. Disponibile nelle taglie 38-48."
    },
    {
        "source_id": "prada_ss25_bag",
        "source_type": "catalogo",
        "content": "Borsa Prada Spring/Summer 2025 in pelle Saffiano. Modello tote con doppi manici. Dimensioni: 35x28x12 cm. Colore: rosa cipria con hardware dorato. Logo triangolare in metallo smaltato. Chiusura magnetica. Tasca interna con zip e due taschine portacellulare. Made in Italy. Prezzo: €1,890."
    },
    {
        "source_id": "armani_trends_2025",
        "source_type": "trend",
        "content": "Giorgio Armani per il 2025 propone il ritorno del minimalismo sofisticato. Palette neutra con focus su beige, grigio perla e blu notte. Tessuti naturali: lino, seta e cotone organico. Silhouette fluide e drappeggi. Abbandono dei loghi vistosi in favore del 'quiet luxury'. Accessori essenziali in pelle martellata."
    },
    {
        "source_id": "valentino_evening",
        "source_type": "catalogo",
        "content": "Abito da sera Valentino Haute Couture in tulle di seta. Gonna a ruota con 8 metri di stoffa. Corpetto ricamato a mano con 3000 cristalli Swarovski. Tempo di realizzazione: 180 ore. Colore: rosso Valentino iconico. Disponibile solo su misura. Prezzo su richiesta. Collezione Red Carpet 2025."
    },
    {
        "source_id": "fendi_material_guide",
        "source_type": "materiali",
        "content": "Guida materiali Fendi: Pelliccia ecologica Fendi Fur-Free realizzata con fibre riciclate. Pelle di vitello conciata al vegetale senza cromo. Tessuto FF jacquard in cotone biologico. Canvas impermeabile con trattamento idrorepellente. Metalli nickel-free con placcatura oro 24k. Certificazione sostenibilità: ISO 14001."
    }
]